// LAB-10.2.cpp
// Сушинський Ігор
// Лабораторія №10.2
// Пошук слів у текстовому файлі.
// Варіант 18

#define _CRT_SECURE_NO_WARNINGS
#include <iostream>
#include <fstream>
#include <string>
#include <Windows.h>

using namespace std;

void CreateTXT(char* fname) // створення файлу з введених рядків
{
	ofstream fout(fname); // відкрили файл для запису
	char ch; // відповідь користувача – чи продовжувати введення
	string s; // введений користувачем рядок
	do
	{
		cin.get(); // очищуємо буфер клавіатури – щоб не було символу
		cin.sync(); // «кінець рядка», який залишився після вводу числа
		cout << "Ввести рядок: "; getline(cin, s); // ввели рядок
		fout << s << endl; // записали його у файл
		cout << "Продовжити? (y/n): "; cin >> ch;
	} while (ch == 'y' || ch == 'Y');
	cout << endl;
}

void PrintTXT(char* fname) // виведення файлу на екран
{
	ifstream fin(fname); // відкрили файл для зчитування
	string s; // прочитаний рядок
	while (getline(fin, s)) // поки можна прочитати рядок
	{
		cout << s << endl; // виводимо його на екран
	}
	cout << endl;
}

int ProcessTXT(char* fname) // підрахунок довжини найкоротшого слова
{
	ifstream fin(fname); // відкрили файл для зчитування
	string s;
	int k = 0; // довжина слова
	int min = 0; // мінімальне значення

	while (getline(fin, s)) // поки можна прочитати рядок скануємо його і обчислюємо довжину
	{
		for (int i = 0; i < s.length(); i++)
		{
			k++;											// лічильник довжини слова
			if ((s[i + 1] == ' ') || (s[i + 1] == '\0'))	// якщо наступний символ пробіл або нуль-символ, то
			{
				if (min == 0)								// якщо min=0 — це значить, що я знайшов перше слово та
					min = k;								// мінімальним значенням за замовчуванням буде довжина першого слова
				if (k < min)
					min = k;								// якщо довжина слова менше min, то присвоюєм нове значення для min
				k = -1;										// обнуляємо довжину слова. -1, тому що наступний символ у циклі це
			}												// пробіл, а його рахувати не треба
		}
	}
	return min;
}

int main()
{
	SetConsoleCP(1251); // встановлення сторінки win-cp1251 в потік вводу
	SetConsoleOutputCP(1251); // встановлення сторінки win-cp1251 в потік виводу

	// текстові файли
	char fname[100]; // ім'я першого файлу
	cout << "Ввести ім'я файлу: "; cin >> fname;

	CreateTXT(fname); // ввели рядки файлу з клавіатури
	PrintTXT(fname); // вивели вміст першого файлу на екран
	cout << "Довжина найкоротшого слова = " << ProcessTXT(fname) << endl;

	return 0;
}